{
    "FULLSTACK_DEVELOPMENT": "Fullstack Development",
    "BUILDING_RESPONSIVE_WEBSITE_FRONT_END_USING_ANGULAR": "Building responsive website front-end using Angular",
    "CREATING_APPLICATION_BACKEND_IN_NODE_EXPRESS_DOT_NET": "Creating application backend in Node, Express, .NET",
    "DEVELOPING_CUSTOM_AND_INTERACTIVE_MOBILE_APPS": "Developing custom and interactive mobile apps (Android, iOS...) based on customer needs",
    "MANAGING_DATA_SAFELY_WITH_POSTGRESQL_AND_OTHER_RELATIONAL_DBMS": "Managing data safely with PostgreSQL and other relational DBMS",

    "CLOUD_INFRA_ARCHITECTURE": "Cloud Infra-Architecture",
    "EXPERIENCE_WORKING_ON_MULTIPLE_CLOUD_PLATFORMS": "Experience working on multiple cloud platforms including GCP, Oracle Cloud, FireBase, and Render",
    "HOSTING_AND_MAINTAINING_WEBSITES_WITH_CUSTOM_DOMAIN": "Hosting and maintaining websites with customer unique custom domain",
    "SETTING_UP_SOFTWARE_INTEGRATIONS": "Setting up different software integrations based on project needs and requirements",

    "UI_UX_DESIGN": "UI/UX Design",
    "DESIGNING_HIGHLY_ATTRACTIVE_UI": "Design of highly customized and responsive user interfaces for web applications",
    "CUSTOMIZING_LOGO_DESIGNS_AND_VIRTUAL_CARDS": "Logo and icon design to ensure a style consistent with the project's identity",
    "CREATING_FLOW_OF_APPLICATION_FUNCTIONALITIES": "Structuring the application functionality flow to optimize user experience",

    "DIGITAL_SOLUTIONS_CONSULTANCY": "Digital Solutions & Consultancy",
    "HELPING_LOCAL_BUSINESSES_SETUP_NETWORKS": "Helping local businesses set up networks, remote connections and video surveillance",
    "PROVIDING_RELIABLE_AND_CONFIDENTIAL_CONSULTANCY": "Providing various reliable and confidential consultancy regarding both personal and business projects",

    "WORK_EXPERIENCE": "Work Experience",

    "PASSEPARTOUT_ORG_NAME": "Passepartout",
    "PASSEPARTOUT_POSITION": "Software Engineer",
    "PASSEPARTOUT_DURATION": "Feb 2024 - Present",
    "PASSEPARTOUT_LOCATION": "San Marino, RSM",
    "PASSEPARTOUT_LOCATION_TYPE": "On-Site",
    "PASSEPARTOUT_JOB_TYPE": "Full-time",
    "PASSEPARTOUT_TASK_1": "Gained proficiency in Angular and TypeScript through official documentation, tutorials, and internal mentoring. 🚀",
    "PASSEPARTOUT_TASK_2": "Developed full-stack solutions with .NET Framework, working with REST APIs and automation using LINQ and reflection. 🔄",
    "PASSEPARTOUT_TASK_3": "Built responsive Angular interfaces optimized for Desktop, Tablet, and Mobile. 📱💻",
    "PASSEPARTOUT_TASK_4": "Integrated MAUI for cross-platform development, with minimal native support in Kotlin and Swift to overcome technical limitations. 🔗",

    "ARAGOSTA_ORG_NAME": "Hotel Aragosta (Cattolica)",
    "ARAGOSTA_POSITION": "IT Manager",
    "ARAGOSTA_DURATION": "Sep 2023 - Jun 2017 (~4 months per year)",
    "ARAGOSTA_LOCATION": "Cattolica, Italy",
    "ARAGOSTA_LOCATION_TYPE": "On-Site",
    "ARAGOSTA_JOB_TYPE": "Full-time",
    "ARAGOSTA_TASK_1": "Managed IT operations for a large hotel chain with its main hub at Aragosta, developing strong problem-solving skills in system administration. 🏨",
    "ARAGOSTA_TASK_2": "Independently developed a full-stack Node.js project using MySQL, Bootstrap, and JavaScript. 🖥️",
    "ARAGOSTA_TASK_3": "Implemented and maintained Wi-Fi networks, LAN infrastructure, and Windows Server for centralized data access. 🌐",
    "ARAGOSTA_TASK_4": "Configured VMWare for virtualized environments, set up VPNs, and managed remote access via RDP. 🔧",
    "ARAGOSTA_TASK_5": "Installed and managed CCTV systems, reservation software, and access control systems across multiple hotels. 🔐",

    "ZUCCHETTI_ORG_NAME": "Zucchetti",
    "ZUCCHETTI_POSITION": "Jr Software Engineer",
    "ZUCCHETTI_DURATION": "Mar 2020 - Mar 2021",
    "ZUCCHETTI_LOCATION": "Rimini, Italy",
    "ZUCCHETTI_LOCATION_TYPE": "On-Site",
    "ZUCCHETTI_JOB_TYPE": "Full-time",
    "ZUCCHETTI_TASK_1": "Gained practical experience in management, fiscal, and financial systems from a developer’s perspective, using tools like Site Painter and Portal Studio. 💻",
    "ZUCCHETTI_TASK_2": "Worked with technologies like Java, JavaScript, HTML, CSS, and SQL, handling both server-side and client-side development, focusing on relational databases (PostgreSQL, MySQL) and dynamic, adaptive web pages. 🌐",
    "ZUCCHETTI_TASK_3": "Main tasks included bug fixing, restyling, reorganizing legacy applications, and providing support for custom software development tailored to customer needs. 🔧",

    "INTERNSHIPS": "Internships",
    "ICS_COMPUTER": "ICS Computer",
    "JR_IT_TECHNICIAN": "Jr IT Technician",
    "HIGH_SCHOOL_INTERNSHIP": "High School Internship",
    "ICS_LOCATION": "Rimini, Italy",
    "PROVIDED_HANDS_ON_SUPPORT_IN_SOFTWARE_REPAIR": "Provided hands-on support in software repair, including virus removal, disk cleanup, and data recovery, ensuring optimal system performance. 🖥️",
    "ASSISTED_IN_NETWORK_MAINTENANCE": "Assisted in network maintenance and IT support for local businesses, gaining exposure to real-world system administration tasks. 🌐",
    "GRATEFUL_FOR_TEAM_GUIDANCE": "Grateful for the team’s guidance during these few weeks, which gave me a strong first imprint in the IT field and a deeper understanding of technical support and infrastructure management. 🙌🚀",

    "MY_PROJECTS": "My Projects",
    "SHOWCASING_INNOVATIVE_SOLUTIONS_AND_REAL_WORLD_APPLICATIONS": "I hope to add more soon: in the meantime, \"it's not much, but... it's an honest job.\" ⌛",
    "LITERALLY_THIS_PORTFOLIO": "Literally this portfolio!",
    "BEACH_MANAGEMENT_SOFTWARE": "Beach Management Software",
    "ANGULAR_BASED_PORTFOLIO_SHOWCASING_PROJECTS_AND_SKILLS": "📂 An Angular-based, fully responsive portfolio showcasing projects and skills. Deployed on Oracle Cloud, served with Nginx for optimal performance, and designed for seamless user experience. 🚀",
    "JUSTBEACH_SHOWCASING_PROJECTS_AND_SKILLS": "⛱️ A lightweight management software built with Angular, featuring a mobile-first architecture to streamline reservation workflows and payments tracking. 📊",
    "AUTOMATED_RESPONDER_FOR_HOTELS": "Automated Responder for Hotels",
    "AUTOMATED_TOOL_OPTIMIZING_FIRST_RESPONSE_FLOW": "🏨 By leveraging predefined templates, dynamic data integration, and configurable rules, the tool aims to speed up and optimize the first response flow while still allowing for manual adjustments when needed. 🚀",

    "EXTRA_PASSIONS": "Extra / Passions",
    "TRANSFORMING_PASSIONS_INTO_CREATIVE_SOLUTIONS": "🚀 Transforming Passions into Creative Solutions: Music, Drawing and More!",
    "NOT_ONLY_CODING_ALSO_DRAWING": "Not only coding, also... drawing!",
    "PERSONAL_JOURNEY_IN_DIGITAL_DRAWING": "🎨 A personal journey in digital drawing that began years ago, driven by my passion for art. A great way to explore creativity and immerse myself in the pleasure of refining something unique. (I also designed a logo for the Aragosta T-shirts!) 🖌️✨",
    "NOT_ONLY_CODING_ALSO_SINGING": "Not only coding, also... singing!",
    "PASSION_PROJECT_ROOTED_IN_MUSICAL_JOURNEY": "🎵 A passionate project rooted in a musical journey that started years ago and, although I'm no longer a prolific publisher... I remain a faithful lover. Music has always been a creative path: it's about expression, growth, and balance. 🌱🎧",

    "HIGH_SCHOOL_DIPLOMA": "High School Diploma",
    "INFORMATION_TECHNOLOGY": "Information Technology",
    "SEP_2013_JUN_2018": "Sep 2013 - Jun 2018",
    "FUNDAMENTALS_OF_COMPUTER_SCIENCE_AND_PROGRAMMING": "Fundamentals of Computer Science and Programming, focusing on languages such as C, C#, and SQL, computational logic, and basic software development. 💻🔍",
    "NETWORKS_SYSTEMS_AND_SECURITY": "Networks, Systems, and Security, with knowledge in network configuration, system administration, cybersecurity, and database management. 🌐🛡️",
    "HANDS_ON_EXPERIENCE_THROUGH_PROJECT_BASED_LEARNING_1": "Hands-on experience and project-based learning through labs, application development, hardware/software troubleshooting, and real-world IT environment simulations. 🛠️🚀",

    "BACHELORS_DEGREE_IN_INFORMATION_TECHNOLOGY": "Bachelor's Degree in Information Technology",
    "COMPUTER_SCIENCE_AND_ENGINEERING": "Computer Science and Engineering",
    "SEP_2018_MAR_2023": "Sep 2018 - Mar 2023",
    "FOUNDATION_IN_SOFTWARE_ENGINEERING": "Building a strong foundation in Software Engineering, with skills in algorithms, data structures, web programming, object-oriented programming, and system architectures. 💻⚙️",
    "DEEPENING_KNOWLEDGE_IN_SYSTEMS_NETWORKS_AND_SECURITY": "Deepening knowledge in Systems, Networks, and Security, focusing on computer networks, cybersecurity, cloud computing, and IT infrastructure management. 🔗🛡️",
    "HANDS_ON_EXPERIENCE_THROUGH_PROJECT_BASED_LEARNING_2": "Hands-on experience and project-based learning through labs, software development and data analysis preparing for roles in tech companies and research. 🚀💡",

    "PRELIMINARY_ENGLISH_TEST": "Preliminary English Test",
    "UK_NATIONAL_QUALIFICATIONS_FRAMEWORK": "refers to the UK National Qualifications Framework",
    "PASS_WITH_DISTINCTION": "“Pass with Distinction” (162 / 170)",
    "ENGLISH_LANGUAGE_SPECIALIZATION": "English Language Specialization 📚",

    "IVAN_TESORO": "Ivan Tesoro",
    "PROFESSIONAL_TITLE": "Software Development | Network Management | Freelancing",
    "SOFTWARE_ENGINEER_PASSIONATE_ABOUT_COMPUTER_SCIENCE_AND_ITS_EVOLUTION": "A software engineer passionate about computer science and its evolution, with experience in full-stack development of high-quality solutions focused on the needs of the most diverse users.",
    "FULL_STACK_DEVELOPMENT": "Full-stack development",
    "PROJECTS_AND_FREELANCING": "Projects & Freelancing",
    "MY_WORKS_INTERNSHIPS_AND_FREELANCING": "My Works, Internships and Freelancing",
    "DEGREES_AND_QUALIFICATIONS": "Degrees and Qualifications",
    "ACHIEVEMENTS_PARTICIPATION_AND_COMMUNITY_INVOLVEMENT": "Achievements, Participation and Community Involvement",
    "PROJECTS": "Projects",
    "PROJECTS_DESCRIPTION": "🌍Leveraging cutting-edge technologies, I specialize in the design and deployment of web applications on robust cloud infrastructures, ensuring high-performance and scalable solutions.",
    "EXPERIENCE": "Experience",
    "EXPERIENCE_DESCRIPTION": "💼 From Corporate Giants to Creative Freelance Projects: A journey through internships, corporate, and helping local businesses.",
    "EDUCATION": "Education",
    "EDUCATION_DESCRIPTION": "🎓 A Journey of Continuous Learning: Building Skills, Solving Problems, and Shaping the Future 🌟",
    "ACHIEVEMENTS": "Achievements",
    "ACHIEVEMENTS_DESCRIPTION": "🚀 Milestones, Contributions & Impact: Driving Innovation, Engaging Communities, and Making a Difference 🌍",

    "Home": "Home",
    "Experience": "Experience",
    "Education": "Education",
    "Projects": "Projects",
    "Contact": "Contact",
    "Resume": "Resume",

    "WHAT_I_DO": "What I do?",
    "ACADEMIC_BACKGROUND": "Academic background",
    "CLICK_TO_TRANSLATE": "🧙‍♂️💭-- Clicca il logo per tradurre in Italiano!",

    "VISIT_WEBSITE": "Visit website",
    "VISIT": "Visit",
    "CONFIDENTIAL": "Confidential",

    "STAR_ME_ON_GITHUB": "Star Me On GitHub"
}
